fonecmid-diplom/src/Catalogs/ВКМ_Сотрудники/ВКМ_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_Сотрудники</name>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>EnumRef.ВКМ_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВКМ_Должности/ВКМ_Должности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_Должности</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ВКМ_Сотрудники/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЗарплатныхРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	Если Объект.Должность = ПредопределенноеЗначение("Перечисление.ВКМ_Должности.Специалист") Тогда
		Элементы.ПроцентОтРабот.Видимость = Истина;
	Иначе
		Элементы.ПроцентОтРабот.Видимость = Ложь;
		Объект.ПроцентОтРабот = Неопределено;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЗарплатныхРеквизитов()
	
	ЕстьПравоНаЗарплату = ПравоДоступа("Изменение", Метаданные.Справочники.ВКМ_Сотрудники)
	                     И ПравоДоступа("Редактирование", Метаданные.Справочники.ВКМ_Сотрудники);
	
	Элементы.Оклад.Видимость          = ЕстьПравоНаЗарплату;
	Элементы.ПроцентОтРабот.Видимость = ЕстьПравоНаЗарплату;
	Элементы.ДействуетС.Видимость     = ЕстьПравоНаЗарплату;
	
КонецПроцедуры

#КонецОбласти
